#230116
n = int(input())
for i in range(1, n+1):
    print('*' * i)
'''
테스트 1 〉	통과 (14.37ms, 7.47MB)
테스트 2 〉	통과 (11.27ms, 7.46MB)
테스트 3 〉	통과 (11.28ms, 7.48MB)
테스트 4 〉	통과 (11.78ms, 7.5MB)
테스트 5 〉	통과 (13.85ms, 7.45MB)
테스트 6 〉	통과 (11.55ms, 7.57MB)
테스트 7 〉	통과 (15.62ms, 7.4MB)
테스트 8 〉	통과 (10.95ms, 7.44MB)
테스트 9 〉	통과 (12.10ms, 7.44MB)
테스트 10 〉	통과 (10.77ms, 7.47MB)
'''
n = int(input())
for i in range(1, n+1):
    print(''.rjust(i, '*'))
'''
테스트 1 〉	통과 (11.37ms, 7.61MB)
테스트 2 〉	통과 (10.86ms, 7.53MB)
테스트 3 〉	통과 (12.13ms, 7.49MB)
테스트 4 〉	통과 (11.19ms, 7.46MB)
테스트 5 〉	통과 (10.95ms, 7.6MB)
테스트 6 〉	통과 (11.15ms, 7.61MB)
테스트 7 〉	통과 (11.47ms, 7.52MB)
테스트 8 〉	통과 (11.76ms, 7.5MB)
테스트 9 〉	통과 (12.01ms, 7.55MB)
테스트 10 〉	통과 (10.98ms, 7.5MB)
'''

n = int(input())
for i in range(1, n+1):
    print(''.ljust(i, '*'))
'''
테스트 1 〉	통과 (11.01ms, 7.6MB)
테스트 2 〉	통과 (11.25ms, 7.56MB)
테스트 3 〉	통과 (12.23ms, 7.51MB)
테스트 4 〉	통과 (13.23ms, 7.45MB)
테스트 5 〉	통과 (10.69ms, 7.48MB)
테스트 6 〉	통과 (11.25ms, 7.48MB)
테스트 7 〉	통과 (12.23ms, 7.49MB)
테스트 8 〉	통과 (12.55ms, 7.49MB)
테스트 9 〉	통과 (11.05ms, 7.5MB)
테스트 10 〉	통과 (10.72ms, 7.52MB)
'''